## 🏗️ Terraform Plan Preview

## 📋 Terraform Plan Summary

### Resource Changes

- ✅ **Resources to Add:** 15
- 🔄 **Resources to Change:** 2
- ❌ **Resources to Destroy:** 0
0

<details>
<summary>📄 Full Plan Output (click to expand)</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_service.api will be updated in-place
  ~ resource "aws_ecs_service" "api" {
        id                                 = "arn:aws:ecs:us-west-2:462498369025:service/protein-classifier-api-1-0-0-prod-cluster/protein-classifier-api-service"
        name                               = "protein-classifier-api-service"
        tags                               = {
            "Description" = "ECS Fargate service running protein classifier API"
            "Name"        = "protein-classifier-api-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-west-2:462498369025:task-definition/protein-classifier-api:6" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.api will be created
  + resource "aws_ecs_task_definition" "api" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 512
                  + environment      = [
                      + {
                          + name  = "AWS_REGION"
                          + value = "us-west-2"
                        },
                      + {
                          + name  = "BASE_URL"
                          + value = "https://api.proteinclassifier.com"
                        },
                      + {
                          + name  = "DYNAMODB_API_KEYS_TABLE"
                          + value = "protein-classifier-api-keys"
                        },
                      + {
                          + name  = "DYNAMODB_MAGIC_LINKS_TABLE"
                          + value = "protein-classifier-magic-link-tokens"
                        },
                      + {
                          + name  = "DYNAMODB_SESSIONS_TABLE"
                          + value = "protein-classifier-user-sessions"
                        },
                      + {
                          + name  = "DYNAMODB_USAGE_AUDIT_TABLE"
                          + value = "protein-classifier-audit-logs"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "Prod"
                        },
                      + {
                          + name  = "JWT_SECRET_NAME"
                          + value = "protein-classifier-jwt-secret-key"
                        },
                      + {
                          + name  = "PORT"
                          + value = "8000"
                        },
                      + {
                          + name  = "SES_CONFIGURATION_SET"
                          + value = "protein-classifier-email"
                        },
                      + {
                          + name  = "SES_FROM_EMAIL"
                          + value = "noreply@proteinclassifier.com"
                        },
                    ]
                  + essential        = true
                  + healthCheck      = {
                      + command     = [
                          + "CMD-SHELL",
                          + "python -c \"import sys, urllib.request; resp = urllib.request.urlopen('http://localhost:8000/health'); sys.exit(0 if 200 <= resp.getcode() < 400 else 1)\"",
                        ]
                      + interval    = 30
                      + retries     = 3
                      + startPeriod = 60
                      + timeout     = 10
                    }
                  + image            = "462498369025.dkr.ecr.us-west-2.amazonaws.com/protein-classifier-api:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/protein-classifier-api"
                          + awslogs-region        = "us-west-2"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + memory           = 1024
                  + name             = "protein-classifier-api"
                  + portMappings     = [
                      + {
                          + containerPort = 8000
                          + hostPort      = 8000
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::462498369025:role/protein-classifier-ecs-task-execution-role"
      + family                   = "protein-classifier-api"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Description" = "ECS task definition for protein classifier API container"
          + "Name"        = "protein-classifier-api-task"
        }
      + tags_all                 = {
          + "Application" = "protein-classifier-api"
          + "CostCenter"  = "protein-classifier"
          + "Description" = "ECS task definition for protein classifier API container"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-api-task"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + task_role_arn            = "arn:aws:iam::462498369025:role/protein-classifier-ecs-task-role"
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # aws_iam_role_policy.ecs_task_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ecs_task_policy" {
        id     = "protein-classifier-ecs-task-role:protein-classifier-ecs-task-policy"
        name   = "protein-classifier-ecs-task-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-2:462498369025:log-group:/ecs/protein-classifier-api:*"
                      - Sid      = "CloudWatchLogsAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_route53_record.ses_dkim[0] will be created
  + resource "aws_route53_record" "ses_dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z0960642JHAEZB1G2JKV"
    }

  # aws_route53_record.ses_dkim[1] will be created
  + resource "aws_route53_record" "ses_dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z0960642JHAEZB1G2JKV"
    }

  # aws_route53_record.ses_dkim[2] will be created
  + resource "aws_route53_record" "ses_dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z0960642JHAEZB1G2JKV"
    }

  # aws_route53_record.ses_mail_from_mx will be created
  + resource "aws_route53_record" "ses_mail_from_mx" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail.proteinclassifier.com"
      + records         = [
          + "10 feedback-smtp.us-west-2.amazonses.com",
        ]
      + ttl             = 600
      + type            = "MX"
      + zone_id         = "Z0960642JHAEZB1G2JKV"
    }

  # aws_route53_record.ses_mail_from_txt will be created
  + resource "aws_route53_record" "ses_mail_from_txt" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail.proteinclassifier.com"
      + records         = [
          + "v=spf1 include:amazonses.com ~all",
        ]
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z0960642JHAEZB1G2JKV"
    }

  # aws_route53_record.ses_verification will be created
  + resource "aws_route53_record" "ses_verification" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_amazonses.proteinclassifier.com"
      + records         = (known after apply)
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z0960642JHAEZB1G2JKV"
    }

  # aws_secretsmanager_secret.jwt_secret_key will be created
  + resource "aws_secretsmanager_secret" "jwt_secret_key" {
      + arn                            = (known after apply)
      + description                    = "JWT secret key for signing authentication tokens"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = "arn:aws:kms:us-west-2:462498369025:key/6d55c939-5732-4fa3-a462-7fe35c9ef429"
      + name                           = "protein-classifier-jwt-secret-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "Description" = "JWT signing key"
          + "Environment" = "Prod"
          + "Name"        = "protein-classifier-jwt-secret-key"
        }
      + tags_all                       = {
          + "Application" = "protein-classifier-api"
          + "CostCenter"  = "protein-classifier"
          + "Description" = "JWT signing key"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-jwt-secret-key"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
    }

  # aws_secretsmanager_secret_version.jwt_secret_key_initial will be created
  + resource "aws_secretsmanager_secret_version" "jwt_secret_key_initial" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # aws_ses_configuration_set.main will be created
  + resource "aws_ses_configuration_set" "main" {
      + arn                        = (known after apply)
      + id                         = (known after apply)
      + last_fresh_start           = (known after apply)
      + name                       = "protein-classifier-email"
      + reputation_metrics_enabled = true
      + sending_enabled            = true

      + delivery_options {
          + tls_policy = "Require"
        }
    }

  # aws_ses_domain_dkim.main will be created
  + resource "aws_ses_domain_dkim" "main" {
      + dkim_tokens = (known after apply)
      + domain      = "proteinclassifier.com"
      + id          = (known after apply)
    }

  # aws_ses_domain_identity.main will be created
  + resource "aws_ses_domain_identity" "main" {
      + arn                = (known after apply)
      + domain             = "proteinclassifier.com"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # aws_ses_domain_identity_verification.main will be created
  + resource "aws_ses_domain_identity_verification" "main" {
      + arn    = (known after apply)
      + domain = (known after apply)
      + id     = (known after apply)
    }

  # aws_ses_domain_mail_from.main will be created
  + resource "aws_ses_domain_mail_from" "main" {
      + behavior_on_mx_failure = "UseDefaultValue"
      + domain                 = "proteinclassifier.com"
      + id                     = (known after apply)
      + mail_from_domain       = "mail.proteinclassifier.com"
    }

  # aws_ses_email_identity.noreply will be created
  + resource "aws_ses_email_identity" "noreply" {
      + arn   = (known after apply)
      + email = "noreply@proteinclassifier.com"
      + id    = (known after apply)
    }

Plan: 15 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + jwt_secret_arn             = (sensitive value)
  + ses_domain_identity_arn    = (known after apply)
```
</details>

### 🔍 Key Changes Detected

- 🐳 **ECS Service** changes detected
- 🔑 **IAM** changes detected

### ✅ Validation Status

- **Format Check:** ✅ Pass
- **Init:** ✅ Pass
- **Validate:** ✅ Pass
- **Plan:** ✅ Pass


---
<sub>💡 This plan preview helps you review infrastructure changes before applying them.</sub>
